michprev/Dron/BSP/STM32F3xxxx/StartupFiles/startup_stm32f373xc.c
void __attribute__ ((weak)) FPU_IRQHandler() 
{
	//If you hit the breakpoint below, one of the interrupts was unhandled in your code. 
	//Define the following function in your code to handle it:
	//	extern "C" void FPU_IRQHandler();
	asm("bkpt 255");
};

#else
void NMI_Handler()               __attribute__ ((weak, alias ("Default_Handler")));
void HardFault_Handler()         __attribute__ ((weak, alias ("Default_Handler")));
void MemManage_Handler()         __attribute__ ((weak, alias ("Default_Handler")));
void BusFault_Handler()          __attribute__ ((weak, alias ("Default_Handler")));
void UsageFault_Handler()        __attribute__ ((weak, alias ("Default_Handler")));
void SVC_Handler()               __attribute__ ((weak, alias ("Default_Handler")));
void DebugMon_Handler()          __attribute__ ((weak, alias ("Default_Handler")));
void PendSV_Handler()            __attribute__ ((weak, alias ("Default_Handler")));
void SysTick_Handler()           __attribute__ ((weak, alias ("Default_Handler")));
void WWDG_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void PVD_IRQHandler()            __attribute__ ((weak, alias ("Default_Handler")));
void TAMP_STAMP_IRQHandler()     __attribute__ ((weak, alias ("Default_Handler")));
void RTC_WKUP_IRQHandler()       __attribute__ ((weak, alias ("Default_Handler")));
void FLASH_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void RCC_IRQHandler()            __attribute__ ((weak, alias ("Default_Handler")));
void EXTI0_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void EXTI1_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void EXTI2_TSC_IRQHandler()      __attribute__ ((weak, alias ("Default_Handler")));
void EXTI3_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void EXTI4_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel1_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel2_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel3_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel4_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel5_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel6_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_Channel7_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void ADC1_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void CAN_TX_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void CAN_RX0_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void CAN_RX1_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void CAN_SCE_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void EXTI9_5_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void TIM15_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM16_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM17_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM18_DAC2_IRQHandler()     __attribute__ ((weak, alias ("Default_Handler")));
void TIM2_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void TIM3_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void TIM4_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void I2C1_EV_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void I2C1_ER_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void I2C2_EV_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void I2C2_ER_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void SPI1_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void SPI2_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void USART1_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void USART2_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void USART3_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void EXTI15_10_IRQHandler()      __attribute__ ((weak, alias ("Default_Handler")));
void RTC_Alarm_IRQHandler()      __attribute__ ((weak, alias ("Default_Handler")));
void CEC_IRQHandler()            __attribute__ ((weak, alias ("Default_Handler")));
void TIM12_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM13_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM14_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void TIM5_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void SPI3_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void TIM6_DAC1_IRQHandler()      __attribute__ ((weak, alias ("Default_Handler")));
void TIM7_IRQHandler()           __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_Channel1_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_Channel2_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_Channel3_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_Channel4_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_Channel5_IRQHandler()  __attribute__ ((weak, alias ("Default_Handler")));
void SDADC1_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void SDADC2_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void SDADC3_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void COMP1_2_IRQHandler()        __attribute__ ((weak, alias ("Default_Handler")));
void USB_HP_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void USB_LP_IRQHandler()         __attribute__ ((weak, alias ("Default_Handler")));
void USBWakeUp_IRQHandler()      __attribute__ ((weak, alias ("Default_Handler")));
void TIM19_IRQHandler()          __attribute__ ((weak, alias ("Default_Handler")));
void FPU_IRQHandler()            __attribute__ ((weak, alias ("Default_Handler")));
#endif

void * g_pfnVectors[0x62] __attribute__ ((section (".isr_vector"))) = 
{
	&_estack,
	&Reset_Handler,
	&NMI_Handler,
	&HardFault_Handler,
	&MemManage_Handler,
	&BusFault_Handler,
	&UsageFault_Handler,
	NULL,
	NULL,
	NULL,
	NULL,
	&SVC_Handler,
	&DebugMon_Handler,
	NULL,
	&PendSV_Handler,
	&SysTick_Handler,
	&WWDG_IRQHandler,
	&PVD_IRQHandler,
	&TAMP_STAMP_IRQHandler,
	&RTC_WKUP_IRQHandler,
	&FLASH_IRQHandler,
	&RCC_IRQHandler,
	&EXTI0_IRQHandler,
	&EXTI1_IRQHandler,
	&EXTI2_TSC_IRQHandler,
	&EXTI3_IRQHandler,
	&EXTI4_IRQHandler,
	&DMA1_Channel1_IRQHandler,
	&DMA1_Channel2_IRQHandler,
	&DMA1_Channel3_IRQHandler,
	&DMA1_Channel4_IRQHandler,
	&DMA1_Channel5_IRQHandler,
	&DMA1_Channel6_IRQHandler,
	&DMA1_Channel7_IRQHandler,
	&ADC1_IRQHandler,
	&CAN_TX_IRQHandler,
	&CAN_RX0_IRQHandler,
	&CAN_RX1_IRQHandler,
	&CAN_SCE_IRQHandler,
	&EXTI9_5_IRQHandler,
	&TIM15_IRQHandler,
	&TIM16_IRQHandler,
	&TIM17_IRQHandler,
	&TIM18_DAC2_IRQHandler,
	&TIM2_IRQHandler,
	&TIM3_IRQHandler,
	&TIM4_IRQHandler,
	&I2C1_EV_IRQHandler,
	&I2C1_ER_IRQHandler,
	&I2C2_EV_IRQHandler,
	&I2C2_ER_IRQHandler,
	&SPI1_IRQHandler,
	&SPI2_IRQHandler,
	&USART1_IRQHandler,
	&USART2_IRQHandler,
	&USART3_IRQHandler,
	&EXTI15_10_IRQHandler,
	&RTC_Alarm_IRQHandler,
	&CEC_IRQHandler,
	&TIM12_IRQHandler,
	&TIM13_IRQHandler,
	&TIM14_IRQHandler,
	NULL,
	NULL,
	NULL,
	NULL,
	&TIM5_IRQHandler,
	&SPI3_IRQHandler,
	NULL,
	NULL,
	&TIM6_DAC1_IRQHandler,
	&TIM7_IRQHandler,
	&DMA2_Channel1_IRQHandler,
	&DMA2_Channel2_IRQHandler,
	&DMA2_Channel3_IRQHandler,
	&DMA2_Channel4_IRQHandler,
	&DMA2_Channel5_IRQHandler,
	&SDADC1_IRQHandler,
	&SDADC2_IRQHandler,
	&SDADC3_IRQHandler,
	&COMP1_2_IRQHandler,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	&USB_HP_IRQHandler,
	&USB_LP_IRQHandler,
	&USBWakeUp_IRQHandler,
	NULL,
	&TIM19_IRQHandler,
	NULL,
	NULL,
	&FPU_IRQHandler,
};

void SystemInit();
void __libc_init_array();
int main();

extern void *_sidata, *_sdata, *_edata;
extern void *_sbss, *_ebss;

void __attribute__((naked, noreturn)) Reset_Handler()
{
	//Normally the CPU should will setup the based on the value from the first entry in the vector table.
	//If you encounter problems with accessing stack variables during initialization, ensure 
	//asm ("ldr sp, =_estack");

	void **pSource, **pDest;
	for (pSource = &_sidata, pDest = &_sdata; pDest != &_edata; pSource++, pDest++)
		*pDest = *pSource;

	for (pDest = &_sbss; pDest != &_ebss; pDest++)
		*pDest = 0;

	SystemInit();
	__libc_init_array();
	(void)main();
	for (;;) ;
}

void __attribute__((naked, noreturn)) Default_Handler()
{
	//If you get stuck here, your code is missing a handler for some interrupt.
	//Define a 'DEBUG_DEFAULT_INTERRUPT_HANDLERS' macro via VisualGDB Project Properties and rebuild your project.
	//This will pinpoint a specific missing vector.
	for (;;) ;
}
